CaseUTwithWallFunctions/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// Laminar viscosity
nu              nu [0 2 -1 0 0 0 0] 1.6e-05;

// Thermal expansion coefficient
beta            beta [0 0 0 -1 0 0 0] 3.5e-03;

// Reference temperature
TRef            TRef [0 0 0 1 0 0 0] 298;

// Laminar Prandtl number
Pr              Pr [0 0 0 0 0 0 0] 0.72;

// Turbulent Prandtl number
Prt             Prt [0 0 0 0 0 0 0] 0.85;

// Turbulent Schmidt number
Sct		Sct [0 0 0 0 0 0 0] 0.85;

// Passive scalar diffusion coefficient, constant in similitude if viscosities match
Ds              Ds [0 2 -1 0 0 0 0] 1.76e-5;

// Heat capacity
Cp0		Cp0 [0 2 -2 -1 0 0 0] 1005;

// Fluid density
rho0		rho0 [1 -3 0 0 0 0 0] 1.2;

// ************************************************************************* //
