CaseUTwithWallFunctions/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    outlet
    {
	type		fixedValue;
	value		uniform 0;
    }

    bottom
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    top
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    front
    {
        type 		cyclic;
	neighbourPatch 	back;
    }

    back
    {
        type 		cyclic;
	neighbourPatch 	front;
    }
}

// ************************************************************************* //
